    Pandas, Python programlama dili için yüksek performanslı, kullanımı kolay veri yapıları ve veri analizi araçları sağlayan, açık kaynaklı, BSD lisanslı bir kütüphanedir.
    Proje ana sayfası: https://pandas.pydata.org/

In [2]:
import pandas as pd

# Pandas ile Veri Okuma

In [3]:
df = pd.read_csv("D:/Datasets/Advertising.csv")

In [4]:
df.head()

   ID     TV  Radio  Newspaper  Sales
0   1  230.1   37.8       69.2   22.1
1   2   44.5   39.3       45.1   10.4
2   3   17.2   45.9       69.3    9.3
3   4  151.5   41.3       58.5   18.5
4   5  180.8   10.8       58.4   12.9

# Pandas Dataframe Şekli, Boyutu

In [6]:
df.shape

(200, 5)

In [7]:
df.tail()

      ID     TV  Radio  Newspaper  Sales
195  196   38.2    3.7       13.8    7.6
196  197   94.2    4.9        8.1    9.7
197  198  177.0    9.3        6.4   12.8
198  199  283.6   42.0       66.2   25.5
199  200  232.1    8.6        8.7   13.4

# Dataframe hakkında daha detaylı bilgi

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
ID           200 non-null int64
TV           200 non-null float64
Radio        200 non-null float64
Newspaper    200 non-null float64
Sales        200 non-null float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [9]:
df.describe()

               ID          TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000  200.000000
mean   100.500000  147.042500   23.264000   30.554000   14.022500
std     57.879185   85.854236   14.846809   21.778621    5.217457
min      1.000000    0.700000    0.000000    0.300000    1.600000
25%     50.750000   74.375000    9.975000   12.750000   10.375000
50%    100.500000  149.750000   22.900000   25.750000   12.900000
75%    150.250000  218.825000   36.525000   45.100000   17.400000
max    200.000000  296.400000   49.600000  114.000000   27.000000

# Sütunları Seçmek

In [43]:
df['SPENDINGSCORE'].head()

0    39
1    81
2     6
3    77
4    40
Name: SPENDINGSCORE, dtype: int64

In [44]:
df.SPENDINGSCORE.head()

0    39
1    81
2     6
3    77
4    40
Name: SPENDINGSCORE, dtype: int64

#  Birden fazla sütunu seçmek (liste içinde seçmeyi unutmayın!!!)

In [22]:
df[['ANNUALINCOME','SPENDINGSCORE']].head()

   ANNUALINCOME  SPENDINGSCORE
0         15000             39
1         15000             81
2         16000              6
3         16000             77
4         17000             40

# Mevcut Bir Sutünun Değerlerini Değiştirmek

In [15]:
df['ANNUALINCOME2'] = df.ANNUALINCOME * 1000

In [16]:
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE  ANNUALINCOME2
0           1    Male   19         15000             39       15000000
1           2    Male   21         15000             81       15000000
2           3  Female   20         16000              6       16000000
3           4  Female   23         16000             77       16000000
4           5  Female   31         17000             40       17000000

In [23]:
df['ANNUALINCOME'] = df.ANNUALINCOME / 1000

In [24]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOME2,INCOMECAT
0,1,Male,19,15000.0,39,15000000,NaN
1,2,Male,21,15000.0,81,15000000,NaN
2,3,Female,20,16000.0,6,16000000,NaN
3,4,Female,23,16000.0,77,16000000,NaN
4,5,Female,31,17000.0,40,17000000,NaN

# Yeni Sütun Eklemek

In [25]:
df['ANNUALINCOMETL'] = df.ANNUALINCOME * 6.0

In [26]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOME2,INCOMECAT,ANNUALINCOMETL
0,1,Male,19,15000.0,39,15000000,NaN,90000.0
1,2,Male,21,15000.0,81,15000000,NaN,90000.0
2,3,Female,20,16000.0,6,16000000,NaN,96000.0
3,4,Female,23,16000.0,77,16000000,NaN,96000.0
4,5,Female,31,17000.0,40,17000000,NaN,102000.0

In [27]:
df.shape

(200, 8)

# Kategorik Değişken Üreterek Yeni Sütun Yaratmak

In [28]:
# Yıllık 40K'dan küçükse low, 40K-100K arası middle, 100K üzeri high olsun

op_labels = ['low', 'middle', 'high']
category = [0,40000,100000,150000]
df['INCOMECAT'] = pd.cut(df['ANNUALINCOME'], labels=op_labels, 
                         bins=category, include_lowest=False)

In [29]:
df[df.ANNUALINCOME > 100000].head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOME2,INCOMECAT,ANNUALINCOMETL
186,187,Female,54,101000.0,24,101000000,high,606000.0
187,188,Male,28,101000.0,68,101000000,high,606000.0
188,189,Female,41,103000.0,17,103000000,high,618000.0
189,190,Female,36,103000.0,85,103000000,high,618000.0
190,191,Female,34,103000.0,23,103000000,high,618000.0

# Sütunları Birleştirmek

In [37]:
df['ANN-INCOMECAT'] = df['ANNUALINCOME'] + ' - ' + df['INCOMECAT']

TypeError: ufunc 'add' did not contain a loop with signature matching types dtype('<U32') dtype('<U32') dtype('<U32')

In [38]:
# int ile string birleşmez.
df['ANN-INCOMECAT'] = df['ANNUALINCOME'].astype(str) + ' - ' + df['INCOMECAT'].astype(str)

In [38]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT
0,1,Male,19,15000.0,39,90000.0,low,15000.0 - low
1,2,Male,21,15000.0,81,90000.0,low,15000.0 - low
2,3,Female,20,16000.0,6,96000.0,low,16000.0 - low
3,4,Female,23,16000.0,77,96000.0,low,16000.0 - low
4,5,Female,31,17000.0,40,102000.0,low,17000.0 - low

# Her satır için benzersiz bir id oluşturmak

In [39]:
# Kaç satır var?
len(df)

200

In [40]:
df['ID'] = range(0,200)
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOME2,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT,ID
0,1,Male,19,15000.0,39,15000.0,90000.0,low,15000.0 - low,0
1,2,Male,21,15000.0,81,15000.0,90000.0,low,15000.0 - low,1
2,3,Female,20,16000.0,6,16000.0,96000.0,low,16000.0 - low,2
3,4,Female,23,16000.0,77,16000.0,96000.0,low,16000.0 - low,3
4,5,Female,31,17000.0,40,17000.0,102000.0,low,17000.0 - low,4

# Sütunları Yeniden Adlandırmak

In [41]:
sutun_degisimi = {'ID':'ROWID'}
df.rename(columns=sutun_degisimi, inplace=True)
# inplace=True demek bu değişimi bellekte gerçekleştir.
# inplace=True işleminin geri dönüşü yoktur. Veriyi baştan okumak gerekir.

In [42]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOME2,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT,ROWID
0,1,Male,19,15000.0,39,15000.0,90000.0,low,15000.0 - low,0
1,2,Male,21,15000.0,81,15000.0,90000.0,low,15000.0 - low,1
2,3,Female,20,16000.0,6,16000.0,96000.0,low,16000.0 - low,2
3,4,Female,23,16000.0,77,16000.0,96000.0,low,16000.0 - low,3
4,5,Female,31,17000.0,40,17000.0,102000.0,low,17000.0 - low,4

# Sütunların Sırasını Değiştirmek

In [63]:
# ROWID'yi en başa almak istiyorum

In [64]:
df.columns

Index(['CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE',
       'ANNUALINCOMETL', 'INCOMECAT', 'ANN-INCOMECAT', 'ROWID'],
      dtype='object')

In [43]:
df = df[['ROWID','CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE',
       'ANNUALINCOMETL', 'INCOMECAT', 'ANN-INCOMECAT']]

In [44]:
df.head()

,ROWID,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOMETL,INCOMECAT,ANN-INCOMECAT
0,0,1,Male,19,15000.0,39,90000.0,low,15000.0 - low
1,1,2,Male,21,15000.0,81,90000.0,low,15000.0 - low
2,2,3,Female,20,16000.0,6,96000.0,low,16000.0 - low
3,3,4,Female,23,16000.0,77,96000.0,low,16000.0 - low
4,4,5,Female,31,17000.0,40,102000.0,low,17000.0 - low

# Ödev-10

In [1]:
# simple_data.csv verisini kullanarak;

# 1. Sütun İsimlerini BÜYÜK HARFLİ yapınız
# 2. Yeni bir sütun içinde meslek,sehir sütunlarını aralarında çizgi 
#    olacak şekilde birleştiriniz.
# 3. aylik_gelir'i dolar cinsinden hesaplayarak aylik_gelir_dolar ismiyle 
#    yeni bir sütun ekleyiniz.
# 4. 3801'den başlayacak şekilde 3802, 3803... artarak her bir satıra 
#    id numarası veriniz (yeni bir sütun içinde)
# 5. aylik_geliri baz alarak 0-2500 arasını düşük, 2500-7500 arasını orta ve 
#    7500 üstünü yüksek olacak şekilde 
#    kategorilendirip gelir_kategori ismiyle yeni bir sütun olarak ekleyiniz.